/* 
  Localizable.strings
  MiniProgram

  Created by zacharysu(粟子明) on 2020/6/9.
  Copyright © 2020 Tencent. All rights reserved.
*/
"App.Name" = "WeChat";
"Common.Dialog.OK" = "OK";
"Common.Dialog.Cancel" = "Cancel";
"Common.Navigation.Back" = "Back";
"Common.Cancel" = "Cancel";
"Common.Delete" = "Delete";
"Common.Send" = "OK";
"Common.Exit" = "Exit";
"Common.Close" = "Close";
"Common.More" = "More";
"Common.Alert.Hint.Title" = "Notes";
"JSScopeConfirmWindow_Title_Login" = "Log in via WeChat";
"JSScopeConfirmWindow_Title_Authorize" = "WeChat Authorization";
"JSScopeConfirmWindow_Description" = "%@ requests the below authorizations:";
"JSScopeConfirmWindow_Allow" = "Allow";
"JSScopeConfirmWindow_Reject" = "Cancel";
"JSScopeConfirmWindow_Account_Desc" = "WeChat Personal Information";
"JSScope.Privacy.Location.Desc" = "Go to your Mac's \"System Preferences\" > \"Security & Privacy\" > \"Location Services\" and allow WeChat to access your location.";
"JSScope.Privacy.PhotoAdd.Desc" = "Go to your Mac's \"System Preferences\" > \"Security & Privacy\" > \"Photos\" and allow WeChat to access your photos.";
"JSScope.Privacy.Camera.Desc" = "Go to your Mac's \"System Preferences\" > \"Security & Privacy\" > \"Camera\" and allow WeChat to access your front camera.";
"JSScope.Privacy.Microphone.Desc" = "Go to your Mac's \"System Preferences\" > \"Security & Privacy\" > \"Microphone\" and allow WeChat to access your microphone.";
"JSScope.Privacy.ScreenCapture.Desc" = "Go to your Mac \"System Preferences\" > \"Security & Privacy\" > \"Screen Recording\" and allow WeChat to record screen content..";
"WCAppBrand_MenuItem_Setting" = "Settings";
"WCAppBrand_MenuItem_BannerQuickAddTips" = "Add %@ to My Mini Programs?";
"WCAppBrand_MenuItem_OpenDebugMode" = "Enable Debugging";
"WCAppBrand_MenuItem_CloseDebugMode" = "Disable Debugging";
"WCAppBrand_MenuItem_OpenPerformance" = "Show Performance Window";
"WCAppBrand_MenuItem_ClosePerformance" = "Close Performance Window";
"WCAppBrand_MenuItem_DebugModeTips" = "Will take effect after reopening";
"WCAppBrand_MenuItem_Focused" = "Added";
"WCAppBrand_MenuItem_Expose" = "Report";
"WCAppBrand_MenuItem_Feedback" = "Feedback";
"WCAppBrand_MenuItem_StaredToast" = "Added";
"WCAppBrand_MenuItem_StarFailed" = "Unable to add";
"WCAppBrand_MenuItem_UnstaredToast" = "Canceled";
"WCAppBrand_MenuItem_UnstaredFailToast" = "Unable to cancel";
"WCAppBrand_MenuItem_openVCLogTips" = "Test Version Start Time: %@\nTest Version End Time: %@\nDebug Database: %d\nTesting Database Update Time: %@\nTesting Database End Time: %@\nRelease Database Version: %lu\nDatabase Update Time: %@";
"WCAppBrand_MenuItem_BackToMain" = "Back to Home";
"WCAppBrand_MenuItem_BackToChat" = "Show on Top";
"WCAppBrand_MenuItem_RemoveWeappBanner" = "Remove from Top";
"WCAppBrand_MenuItem_LeaveInChatTips" = "Removed from top";
"WCAppBrand_MenuItem_CommonShare" = "Forward";
"WCAppBrand_MenuItem_AddToHomeScreen" = "Add to Desktop";
"WCAppBrand_MenuItem_CommonShareToWeWork" = "Share to WeCom";
"WCAppBrand_MenuItem_CommonShareToWeChat" = "Share to WeChat";
"WCAppBrand_MenuItem_AboutUs" = "About Us";
"WCAppBrand_MenuItem_About" = "Settings";
"WCAppBrand_MenuItem_Comment" = "Comment";
"WCAppBrand_MenuItem_Leave" = "Exit";
"WCAppBrand_MenuItem_CopyPathAndQuery" = "Copy Page Path";
"WCAppBrand_MenuItem_BackToIndex" = "Back to Home";
"WCAppBrand_MenuItem_AddToStar" = "Add to My Mini Programs";
"WCAppBrand_MenuItem_CancelStar" = "Remove from My Mini Programs";
"WCAppBrand_MenuItem_AddToStarSuccess" = "Added";
"WCAppBrand_MenuItem_CancelStarSuccess" = "Removed";
"WCAppBrand_MenuItem_Minimize" = "Minimize";
"WCAppBrand_MenuItem_WideScreen" = "Widescreen";
"WCAppBrand_MenuItem_NarrowScreen" = "Default View";
"WCAppBrand_ImageChoosePanel_OriginImage" = "Full Image";
"WeApp_ChooseImage_Menu_Camera" = "Take Photo";
"WeApp_ChooseImage_Menu_Other" = "Select from Local Drive...";
"WeApp_ChooseImage_No_Camera" = "No camera available";
"WeApp_ChooseImage_No_Camera_Privacy" = "Camera access disabled";
"WeApp_ChooseImage_TakePhoto" = "Take Photo";
"WeApp_ChooseImage_TakePhoto_Confirm" = "Use Photo";
"WeApp_ChooseImage_TakePhoto_Retry" = "Retake";
"WeApp_ChooseImage_TakePhoto_Error" = "Unable to take photo. Check if the camera is available.";
"WeApp_Error_Unknow" = "Unknown error";
"WeApp_OpenTask_AlertTitle" = "Unable to open";
"WeApp_OpenTask_Error_Parameter" = "Parameter error";
"WeApp_OpenTask_Error_ExceedMaxWindow" = "Can only open up to %lu Mini Program windows.";
"WeApp_OpenTask_Error_GameApp" = "Mini Games not supported on WeChat for Mac.";
"WeApp_OpenTask_Error_UnsupportApp" = "This Mini Program is currently not supported on Mac. Please use your mobile phone.";
"WeApp_OpenTask_Error_UnsupportApp_Name" = "The \"%@\" Mini Program is currently not supported on Mac. Please use your mobile phone.";
"WeApp_OpenTask_Error_NoAppID" = "Missing ID";
"WeApp_OpenTask_Error_Foreground" = "Service in use";
"WeApp_OpenTask_Error_Loading" = "Loading in progress";
"WeApp_OpenTask_Error_NoVersion" = "Version error";
"WeApp_OpenTask_Error_HomePage" = "Homepage address error";
"WeApp_OpenTask_Error_CacheInfo" = "Cache information error";
"WeApp_OpenTask_Error_NormalError" = "Unable to open Mini Program. Try again later. (Error code: %d)";
"WeApp_OpenTask_Error_NoPackageError" = "Mini Program expired. Scan QR code again. (Error code: %d)";
"WeApp_OpenTask_Error_InternalError" = "Internal error";
"WeApp_OpenTask_Error_DownloadError" = "Unable to open Mini Program. Check your network. (Error code: %d)";
"WeApp_OpenTask_Error_NavigationNil" = "Unable to push into nav bar";
"WeApp_OpenTask_Error_AppConfigFail" = "Unable to access page settings";
"WeApp_OpenTask_Error_ContactAttributeFail" = "Unable to access attributes";
"WeApp_OpenTask_Error_DebugUinInvalid" = "Access not authorized";
"WeApp_OpenTask_Error_DebugOutOfTime" = "Developer version QR code expired";
"WeApp_OpenTask_Error_DebugDefault" = "QR code error";
"WeApp_OpenTask_Error_LoadContactInfoFail" = "Loading timeout";
"WeApp_OpenTask_Error_RDMNotExist" = "Test version not found";
"WeApp_OpenTask_Error_RDMNetWorkFailed" = "Network request timeout. Try again later.";
"WeApp_OpenTask_Error_RDMHasNoPermission" = "You aren't authorized to use the test version. Contact the Mini Program admin.";
"WeApp_OpenTask_Error_DevHasNoLocalPackInfo" = "Developer version expired. Scan QR code on the developer toolkit.";
"WeApp_OpenTask_Error_CdnDisaster" = "Too many attempts. Try again later.";
"WeApp_Unsupport_Default" = "Feature is currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_insertMap" = "Maps function is currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_startRecord" = "Recording is currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_address" = "Use of address function is currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_InvoiceTitle" = "Invoice function is currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_makePhoneCall" = "Phone calls are currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_scanCode" = "Scan function is currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_card" = "Cards and offers are currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_bluetooth" = "Bluetooth function is currently not supported on Mac. Please use your mobile phone.";
"WeApp_Unsupport_WeRun" = "Unable to access your WeRun step count on Mac. Please use your mobile phone.";
"WeApp_Suspension_Service" = "Mini Program service is temporarily unavailable";
"WeApp_NotSupportThisVersion" = "Not yet released";
"WeApp_Profile_EnterWeApp" = "Open";
"WeApp_Profile_SuggestToFriend" = "Share";
"WeApp_Profile_BussinessScope" = "Services";
"WeApp_Profile_DeveloperInfo" = "Owner";
"WeApp_Profile_BindBrandInfo" = "Related Official Accounts";
"WeApp_Profile_AuthorizationTips" = "Allow \"%@\" to use my:";
"WeApp_Profile_AuthorizationDenyTips" = "If authorization is disabled, some Mini Program features may be affected. Disable now?";
"WeApp_Profile_DenyAuthorization" = "Disable";
"WeApp_Profile_AuthorizationEmptyTip" = "\"%@\" hasn't used any of your information";
"WeApp_Profile_NoMoreBindBrand" = "No more Official Accounts";
"WeApp_Profile_AuthorizationLocationDeny" = "Never";
"WeApp_Profile_AuthorizationLocationWhenInUseAllow" = "While Using";
"WeApp_Profile_AuthorizationLocationAlwaysAllow" = "Always";
"WeApp_Profile_AuthorizationLocationDenyLongVer" = "Never";
"WeApp_Profile_AuthorizationLocationWhenInUseAllowLongVer" = "Only While Using the Mini Program";
"WeApp_Profile_AuthorizationLocationAlwaysAllowLongVer" = "While Using and After Leaving the Mini Program";
"WeApp.ScopeKey.Location.Desc" = "Location";
"WeApp.ScopeKey.Account.Desc" = "User Info";
"WeApp.ScopeKey.Camera.Desc" = "Camera";
"WeApp.ScopeKey.MircoPhone.Desc" = "Microphone";
"WeApp.Camera.Not.Available" = "Camera is already in use or was not detected. Try again later.";
"WeApp.Navigate.MiniProgram.Tip" = "Getting information...";
"WeApp_UserAutoFill_TitlePre" = "Use saved information?";
"WeApp_UserAutoFill_TitleAfter" = "Save entered information?";
"WeApp_UserAutoFill_OpenDetail" = "Learn More";
"WeApp_UserAutoFill_PhoneAuthTitle" = "WeChat Mobile Number Authorization";
"WeApp_UserAutoFill_PhoneAuthAllow" = "Confirm";
"WeApp_UserAutoFill_PhoneVerifyTitle" = "Enter SMS verification code";
"WeApp_UserAutoFill_PhoneVerifyContent" = "Sent to mobile number: %@.";
"WeApp_UserAutoFill_PhoneVerifyNotReceive" = "No verification code received?";
"WeApp_UserAutoFill_PhoneVerifyRetry" = "Resend";
"WeApp_UserAutoFill_PhoneVerifyRetryInfo" = "Incorrect Verification code. Resend.";
"WeApp_UserAutoFill_PhoneVerifyRetryFrequently" = "Too many attempts. Try again later.";
"WeApp_UserAutoFill_PhoneBindTitle" = "No number linked to WeChat account";
"WeApp_UserAutoFill_PhoneBindContent" = "Link a mobile number to your WeChat account to use the autofill feature";
"WeApp_UserAutoFill_PhoneBind" = "Link Mobile";
"WeApp_UserAutoFill_PhoneSmsTips" = "SMS sent";
"WeApp_UserAutoFill_PhoneBindTips" = "Saved successfully";
"WeApp_UserAutoFill_PhoneSmsError" = "Error when sending SMS.";
"WeApp_UserAutoFill_PhoneSmsFail" = "Unable to send SMS.";
"WeApp_UserAutoFill_CountDown" = "Resend after %ds.";
"WeApp_UserAutoFill_AuthInfoTitle" = "About WeChat Mobile Number Authorization";
"WeApp_UserAutoFill_AuthComplaint" = "Report This Mini Program";
"WeApp_GetPhoneNumber_RequireToGet" = "Requests to Obtain";
"WeApp_GetPhoneNumber_YourPhoneListTitle" = "Your Mobile Number";
"WeApp_GetPhoneNumber_ManagePhoneList" = "Manage Mobile Numbers";
"WeApp_GetPhoneNumber_UseOtherPhone" = "Use Other Mobile Number";
"WeApp_GetPhoneNumber_BindedWxPhone" = "Linked to WeChat";
"WeApp_GetPhoneNumber_Reject" = "Deny";
"WeApp_GetPhoneNumber_Allow" = "Allow";
"WeApp_GetPhoneNumber_AuthTitle" = "About 3rd Party Access to Mobile Number";
"WeApp_GetPhoneNumber_AddNewPhone" = "Add Mobile";
"WeApp_GetPhoneNumber_AddNewPhone_CompliantPrefrefix" = "If you experience unusual collection or use of your information, please report it.";
"WeApp_GetPhoneNumber_AddNewPhone_Compliant" = "Report";
"WeApp_GetPhoneNumber_ManagePhone" = "Manage";
"WeApp_GetPhoneNumber_AddNewPhone_ReachLimitation" = "Limit is %d mobile numbers";
"WeApp_GetPhoneNumber_AddNewPhone_Title" = "Add Mobile";
"WeApp_GetPhoneNumber_AddNewPhone_PhoneNumber" = "Mobile";
"WeApp_GetPhoneNumber_AddNewPhone_ConfirmCode" = "Code";
"WeApp_GetPhoneNumber_AddNewPhone_SavePhone" = "Save for Later Use";
"WeApp_GetPhoneNumber_AddNewPhone_SendConfirmCode" = "Resend";
"WeApp_GetPhoneNumber_AddNewPhone_PlaceHolder_EnterValidPhoneNumber" = "Enter valid mobile number";
"WeApp_GetPhoneNumber_AddNewphone_PlaceHolder_EnterConfirmCode" = "6-digit verification code";
"WeApp_GetPhoneNumber_NetError" = "Network error";
"WeApp_RemoteDebug_MaskLabel_Disconnect" = "No network connection...";
"WeApp_RemoteDebug_MaskLabel_Breakpoint" = "Interrupted...";
"WeApp_RemoteDebug_MaskLabel_WaitingIDE" = "Waiting for tool to be added...";
"WeApp_RemoteDebug_MaskLabel_TooMuchMsg" = "Too many backlogged messages...";
"WeApp_RemoteDebug_ConnectLabel_Disconnect" = "Disconnected";
"WeApp_RemoteDebug_ConnectLabel_Connecting" = "Connecting";
"WeApp_RemoteDebug_ConnectLabel_Connected" = "Connected";
"WeApp_RemoteDebug_ConnectLabel_Reconnect" = "Retry attempt %tu...";
"WeApp_RemoteDebug_ServerLabel_None" = "Server--";
"WeApp_RemoteDebug_ServerLabel_Normal" = "Server is normal";
"WeApp_RemoteDebug_ServerLabel_Error" = "Server processing error";
"WeApp_RemoteDebug_ServerLabel_WaitIDE" = "Server messages backlogged";
"WeApp_RemoteDebug_EndReason_NotSupported" = "Current iOS version does not support remote debugging for Mini Games";
"WeApp_RemoteDebug_EndReason_DebugFinish" = "Local debugging ended";
"WeApp_RemoteDebug_EndReason_TicketFail" = "Failed to get ticket";
"WeApp_RemoteDebug_EndReason_IDEQuit" = "Development tool has exited debugging";
"WeApp_RemoteDebug_EndReason_IsDebug" = "Room is being debugged and cannot be added again";
"WeApp_RemoteDebug_SendFail_AskRetry" = "Failed to send. Try again?";
"WeApp_RemoteDebug_ConnectFail_AskRetry" = "Network error. Try again?";
"WeApp_RemoteDebug_PannelString_Expand" = "Expand";
"WeApp_RemoteDebug_PannelString_Shrink" = "Collapse";
"WeApp_RemoteDebug_PannelString_Stop" = "Stop";
"WeApp_RemoteDebug_PannelString_Log" = "Log";
"WeApp_RemoteDebug_PannelString_NeedConfirm" = "To be confirmed";
"WeApp_RemoteDebug_PannelString_NeedSend" = "To be sent";
"WeApp_RemoteDebug_PannelString_HasSend" = "Sent";
"WeApp_RemoteDebug_PannelString_HasRecv" = "Received";
"WeApp_RemoteDebug_PannelString_AlwaysOnTop" = "Always on top";
"WeApp_RemoteDebug_Common_GiveUp" = "Quit";
"WeApp_RemoteDebug_Common_Retry" = "Retry";
"WeApp_RemoteDebug_Connection_Error" = "Error connecting to the developer toolkit";
"WeApp_RemoteDebug_Unsupport" = "Your current system version does not support opening Mini Programs.";
"WeApp_Mac_Tips_EmptyBindPhone_Title" = "Link Your Mobile Number";
"WeApp_Mac_Tips_EmptyBindPhone_Msg" = "You can link it on the WeChat mobile app.";
"WeApp_ForceClose_Title" = "Tip";
"WeApp_ForceClose_InjectJsError" = "Unable to load";
"WeApp_ForceClose_NoActive" = "The Mini Program unexpectedly closed. Try again later.";
"WeApp_ForceClose_ForeApp" = "Insufficient memory. Open Mini Program and try again.";
"weApp_ForceClose_ForeGame" = "Insufficient memory. Open Mini Game and try again.";
"WeApp_ForceClose_PubLibUpdate" = "Resource updated. Restart Mini Program.";
"WeApp_ForceClose_Lock" = "WeChat locked. Restart the Mini Program to use it.";
"WeApp_OpenTask_Error_LaunchWeAppFail" = "Unable to open Mini Program (Error code: %d)";
"WeApp_OpenTask_Error_PushWebViewTimeout" = "Mini Program opening timeout";
"WeApp_OpenTask_Error_EnterAnimationTimeout" = "Mini Program loading timeout";
"WeApp_OpenTask_Error_Multiprocess" = "Processing error occurred. Try opening the Mini Program again later.";
"WeApp_OpenTask_Error_Open" = "Mini Program is updating. Try opening it again later.";
"WeApp_Pay_View_Desc" = "Scan with WeChat to complete payment";
"WeApp_Pay_Success" = "Payment successful";
"WeApp_DebugMode_Dev" = "Developer Version";
"WeApp_DebugMode_RDM" = "Test Version";
"WeApp_Profile_Score" = "";
"WeApp_Profile_Location" = "Locating";
"WeApp_Profile_Voice" = "Recording audio";
"WeApp_Profile_Video" = "Recording screen";
"WeApp_Profile_Home_Disable" = "This is the home page";
"WeApp_Profile_Share_Disable" = "Cannot share this page";
"WeApp_Profile_Setting_Disable" = "Mini Program Settings";
"WeApp_Privacy_Location_Setting" = "Go Set";
"WeApp_Privacy_Location_Service" = "Location Services not enabled";
"WeApp_Privacy_Location_Desc" = "1. Go to \"System Preferences\" > \"Security & Privacy\" > \"Privacy\" > \"Location Services\" > Check \"Enable Location Services\".\n2. Allow \"WeChat\" to use Location Services.";
"WeApp_Crash_Desc" = "The Mini Program process \"%@\" unexpectedly quit. Reopen?";
"WeApp_Crash_Confirm" = "Reopen";
